<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field' => [
        'name' => 'Τίτλος Εγγράφου',
        'deadline' => 'Προθεσμία',
        'author_id' => 'Συγγραφέας',
        'collaborators_id' => 'Συμμετέχοντες',
    ],

    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */
    'column' => [
        'id' => 'ID',
        'name' => 'Τίτλος Εγγράφου',
        'deadline' => 'Προθεσμία',
        'created_at' => 'Δημιουργήθηκε στις',
        'author_avatar' => 'Συγγραφέας',
        'collaborators_avatars' => 'Συμμετέχοντες',
        'author' => [
            'name' => 'Συγγραφέας',
        ],
        'collaborators' => 'Συμμετέχοντες',
        'updated_at' => 'Τελευταία Ενημέρωση',
    ],

    /*
    |--------------------------------------------------------------------------
    | LaTeX Page Labels
    |--------------------------------------------------------------------------
    */
    'page' => [
        'download.tooltip' => 'Λήψη PDF',
        'compile' => [
            'action' => 'Μεταγλώττιση LaTeX',
            'success-title' => 'Το έγγραφο μεταγλωττίστηκε με επιτυχία!',
            'success-body' => 'Το έγγραφο μεταγλωττίστηκε επιτυχώς.',
            'error-title' => 'Σφάλμα Μεταγλώττισης.',
            'error-body' => 'Παρουσιάστηκε σφάλμα κατά τη μεταγλώττιση του εγγράφου.',
        ],
        'create' => [
            'title' => 'Δημιουργία Εγγράφου',
            'notification' => 'Το έγγραφο δημιουργήθηκε με επιτυχία!',
            'button' => 'Δημιουργία Εγγράφου',
        ],

        // Refers to the file upload action
        'file-upload' => [
            'title' => 'Μεταφόρτωση Αρχείων',
            'icon' => 'heroicon-o-document-arrow-up',
            'heading' => 'Μεταφόρτωση Αρχείων',
            'description' => 'Μεταφορτώστε αρχεία για επισύναψη στο έγγραφο.',
            'submit' => 'Μεταφόρτωση Αρχείου(ων)',
        ],
        'list-page-title' => 'Έγγραφα LaTeX',
        'view-page-title' => 'Προβολή Εγγράφου',
        'edit-page-title' => 'Επεξεργασία Εγγράφου',
    ],
];
